tests/benchmark/results/wrk2_final/pool/c500.log
Running 15s test @ http://127.0.0.1:9571/hello
  4 threads and 500 connections
  Thread calibration: mean lat.: 337.259ms, rate sampling interval: 1295ms
  Thread calibration: mean lat.: 1029.025ms, rate sampling interval: 2928ms
  Thread calibration: mean lat.: 348.428ms, rate sampling interval: 1320ms
  Thread calibration: mean lat.: 345.909ms, rate sampling interval: 1332ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     -nanus    -nanus   0.00us    0.00%
    Req/Sec     0.00      0.00     0.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    0.00us
 75.000%    0.00us
 90.000%    0.00us
 99.000%    0.00us
 99.900%    0.00us
 99.990%    0.00us
 99.999%    0.00us
100.000%    0.00us

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.000     1.000000            0          inf
#[Mean    =         -nan, StdDeviation   =         -nan]
#[Max     =        0.000, Total count    =            0]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  50000 requests in 16.63s, 4.82MB read
  Socket errors: connect 0, read 0, write 0, timeout 3645
Requests/sec:   3006.88
Transfer/sec:    296.58KB